/*************************************************************************************************
--
--    USER_INFO 
-- -- DROP TABLE USER_INFO; 
*************************************************************************************************/
 create table usr_mst (
	emp_id                       varchar(   50   )                                                      not null, -- 사원 id
	emp_no                       varchar(   50   )                                                      not null, -- 사원 번호(사번)
	emp_nm                       varchar(  200   )                                                          null, -- 사원 이름 
	dept_id                       varchar(   50   )                                                          null, -- 부서 id
	jobcl_id                       varchar(   50   )                                                          null, -- 직급 id
	/*-------------------------------------------------------------------------------------------------------------*/
	admin_yn                         char(    1   ) default '0'                                          not null, 
	/*-------------------------------------------------------------------------------------------------------------*/
	login_ip                      varchar(   50   )                                                          null, -- 로그인 ip
	login_id                      varchar(   50   )                                                          null, -- 로그인 id
	login_pwd                      varchar(  400   )                                                          null, -- 로그인 암호
	other_pw                      varchar(   50   )                                                          null, -- 기타 암호 
	wk_scope                      varchar(   50   )                                                          null, -- 사용자의 업부 범위   	
	/*-------------------------------------------------------------------------------------------------------------*/
	join_dt                          char(    8   )                                                      not null, -- 입사 일자
	reti_yn                        char(    1   ) default '0'                                          not null, -- 재직 여부 [0:재직/1:퇴사]
	reti_dt                     varchar(    8   )                                                              , -- 퇴직 일자
	/*-------------------------------------------------------------------------------------------------------------*/
	tel_no                        varchar(   50   )                                                              , -- 전화번호
	hp_no                        varchar(   50   )                                                              , -- 전화번호
	fax_no                        varchar(   50   )                                                              , -- 전화번호
	email                         varchar(   50   )                                                              , -- 전자메일 주소
	zip_cd                        varchar(   20   )                                                              , -- 우편번호
	addr_1                         varchar(  200   )                                                              , -- 나머지 주소
	addr_2                         varchar(  200   )                                                              , -- 나머지 주소
	state                         varchar(  200   )                                                              , -- 시/도
	city                          varchar(  200   )                                                              , /*  군/구 */
	dong                          varchar(  200   )                                                              , -- 읍/면/동
	/*-------------------------------------------------------------------------------------------------------------*/
	sex                              char(    1   ) default 'g'                                          not null, -- 성별 resource.getlist('sex_gb' )[m:남성/f:여성/g=중성(모름)]
	birth_dt                      varchar(    8   )                                                              , -- 생일
	birth_dt_gb                         char(    1   ) default '1'                                          not null, -- 생일구분 resource.getlist('birth_gb' )[0=양력/1:음력]
	/*-------------------------------------------------------------------------------------------------------------*/
	user_memo                     varchar(  200   )                                                              , -- 사용자 메모
	sys_memo                     varchar(  200   )                                                              , -- 시스템 메모
	row_ord                     integer           default 0                                            not null, -- 표시 순서 
	row_sts                     integer           default 0                                            not null, -- 데이터 상태 코드
	/*-------------------------------------------------------------------------------------------------------------*/
	upt_ui                     varchar(   50   )                                                              , -- 데이터 수정자 명
	upt_id                     varchar(   50   )                                                              , -- 데이터 수정자 명
	upt_ip                     varchar(   25   )                                                              , -- 데이터 수정자 ip
	upt_dttm                     varchar(   14   )                                                              , -- 데이터 수정일시 
	/*-------------------------------------------------------------------------------------------------------------*/
	crt_ui                     varchar(   50   )                                                              , -- 데이터 생성자 명
	crt_id                     varchar(   50   )                                                              , -- 데이터 생성자 명
	crt_ip                     varchar(   25   )                                                              , -- 데이터 생성자 ip
	crt_dttm                     varchar(   14   )                                                              , -- 데이터 생성 일시
	/*-------------------------------------------------------------------------------------------------------------*/
	access_ip                     varchar(   25   )                                                          null, -- 최종 접속 정보를 읽어간 ip    
	access_dt                     varchar(   14   )                                                          null, -- 최종 접속 정보를 읽어간 시간
	/*-------------------------------------------------------------------------------------------------------------*/
	constraint      pk_usr_info primary key ( emp_id ) 
 ) engine=innodb default charset=utf8;  
  

/*************************************************************************************************
--  index 
*************************************************************************************************/
  create unique index ux_usr_info_login_id     on usr_mst (login_id  );
  
  insert into usr_mst (emp_id , emp_no , emp_nm , login_id , other_pw , join_dt )values('0000', '0000', '0000', '0000' , '0000' ,'19990101');  
    
  
  
